/****************************************************************************************************
* File: WeaponProperties.h
* Description: В данном файле приведено общее описание оружия
* Created by: Andrew Medvedev
* Date: 29.09.2014
* Edda Studio
****************************************************************************************************/

#pragma once

//Описание:
//В данном перечислении преведины возможные типы оружий.
//Базовое оружие может иметь спецификатор, который влияет на анимации.
enum EWeaponType
{
	//Базовые типы оружий
	e_WeaponTypeSword,
	e_WeaponTypeBow,
	e_WeaponTypeAxe,

	//Спецификация
	e_WeaponSubtypeShort = 1 << 4,
	e_WeaponSubtypeLong  = 1 << 5,
};